if OS.mac?
  cask "alacritty"
  cask "clipy"
  #cask "docker"
  cask "flameshot"
  cask "ghostty"
  cask "rectangle"
  cask "visual-studio-code"
  brew "lazydocker"
elsif OS.linux?
  brew "xclip"
end

brew "bat"
brew "bottom"
brew "broot"
brew "cloc"
brew "duf"
brew "dust"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fontconfig"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "gping"
brew "gum"
brew "htop"
brew "hyperfine"
brew "jj"
brew "jq"
brew "just"
brew "lazygit"
brew "neovim"
brew "python3"
brew "ripgrep"
brew "ruff"
brew "sd"
brew "starship"
brew "tldr"
brew "tmux"
brew "tokei"
brew "tree"
brew "typst"
brew "unzip"
brew "uv"
brew "vim"
brew "wakeonlan"
brew "zellij"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# yazi and dependencies
brew "yazi"
brew "chafa"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "sevenzip"
brew "p7zip"
#brew "jq"
brew "poppler"
#brew "fd"
#brew "ripgrep"
#brew "fzf"
#brew "zoxide"
brew "imagemagick"
