alefragnani.bookmarks
christian-kohler.path-intellisense
davidanson.vscode-markdownlint
donjayamanne.githistory
eamodio.gitlens
esbenp.prettier-vscode
fabiospampinato.vscode-monokai-night
formulahendry.auto-rename-tag
github.copilot
github.copilot-chat
glenn2223.live-sass
golang.go
gruntfuggly.todo-tree
humao.rest-client
janjoerke.align-by-regex
mechatroner.rainbow-csv
mhutchie.git-graph
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.remote-explorer
ms-vscode.remote-server
oderwat.indent-rainbow
pkief.material-icon-theme
ritwickdey.liveserver
shd101wyy.markdown-preview-enhanced
sibiraj-s.vscode-scss-formatter
yzane.markdown-pdf
yzhang.markdown-all-in-one
